weatherrequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service3">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:GetWeatherByPlaceName>
            <gs:PlaceName>Spain</gs:PlaceName>
        </gs:GetWeatherByPlaceName>
    </soapenv:Body>
</soapenv:Envelope>
