Programming_Cloud/testsoap/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCountryRequest>
         <gs:nam>Spain</gs:nam>
      </gs:getCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>